duration = 86798769

s = duration
m = s // 60
h = m // 60
d = h // 24
mn = d // 30
y = mn // 12

# список, содержащий абсолютные значения секунд, минут и т.д., ограничение для каждого и наименование
time = [[s, 60, 'сек'], [m, 60, 'мин'], [h, 24, 'ч'], [d, 30, 'сут'], [mn, 12, 'мес'], [y, 1, 'лет']]

for item in time:
    if item[0] >= item[1]:
        item[0] %= item[1]

# вывод результата в форматированном виде
for item in reversed(time):
    if item[0] != 0:
        print(item[0], item[2], end=' ')
